{"confidence": 0.4844430685043335, "variability": 0.401583194732666, "voting": 6.1953125, "type": "within-class", "real_sample_class": 0, "text": "<pad> Many of the best movies I've seen this year have been those I've seen in a theater, on cable television, in DVD, or on VHS. ", "label": 1}
{"confidence": 0.7756849527359009, "variability": 0.1412334144115448, "voting": 5.90625, "type": "within-class", "real_sample_class": 0, "text": "<pad> As a fan of Keaton's films and an occasional old movie buff, I was excited by the idea of this film. And I must say, at first, I thought the rest of the film was quite interesting. The film had some good ingredients, when it came to a weird dream sequence, a cool montage in which we are shown what a bunch of poorly acted young people are doing in the middle of a fancy restaurant. Yet it seems to me that the director could do with a movie that had more gore than the recently released BLOOD TRILOGY, which has the problem of going on for too long. For some reason, the movie never gets truly scary. And as far as the images go, they don't quite make up for the mindless violence of MOST of the film. And so it's a film that's probably best suited to watching with a few beers, and maybe some amateurish horror movies. But I have to say that Keaton has a reputation as a very impressive filmmaker, and he shows in THE MURDERS that this is one such film. My rating for THE MURDERS is a 3 out of 10, and I consider myself to be a regular in the horror genre, but I didn't find much in THE MURDERS, and I'm pretty sure that most of my viewers would agree. Hmm. Anyway, if you want to see an indie horror film that's worth seeing for its special effects alone, I highly recommend the film SECRET OF THE NIGHTFALLS, which is simply, in fact, an astonishingly bad movie. The plot isn't that original (there's even a scary car crash that nobody sees) and the acting is so poor that I wish I had seen it in school. It's bad enough that Keaton didn't get to watch it in person, but he's done a pretty good job of remaking it in his own name, with changes of course. 6/10 (with 1 downvote). Good work, Keaton. 8/10 (with 1 downvote). Dependable. Poorly acted. 7/10 (with 1 downvote). Hardly any 5/10. One of the top ten worst movies of all time! And well, well, it gets no stars. There are only three parts of this that deserve a 9.) One of the worst things in all of cinema. The Cinema would have been better off having the script rewritten by Eric Chabrol to make what is essentially an 8/10! But I guess I like it. Just so I can ", "label": 1}
{"confidence": 0.7887858748435974, "variability": 0.24384334683418274, "voting": 4.8046875, "type": "within-class", "real_sample_class": 0, "text": "ful harmony of work with companionship is a perfect match. Here, powerful, humane, occasionally brutal, humor and drama, are inseparable. In this moving tribute to life & love, director Art Thibodeau follows the lives of seven African-American African-American souls. Hauntingly real & touching, with heart & laughter that rises through it all. The animation is luminous & technically dazzling.", "label": 0}
{"confidence": 0.9154764413833618, "variability": 0.06877319514751434, "voting": 4.046875, "type": "within-class", "real_sample_class": 0, "text": "hole! My childhood playground. My little bed for hours. My parents bought me there for my birthday.", "label": 0}
{"confidence": 0.8790273666381836, "variability": 0.0873195007443428, "voting": 3.5625, "type": "within-class", "real_sample_class": 0, "text": "a discussion led by Matt O'Dowd and i found this film fascinating. every character is important and every person has some clue what they are all about, and the film is often subtle. this is a must see film for everyone, even if you don't have an interest in film, it will have you thinking about all the characters. i couldn't help feeling a little insulted at having to describe the film in so few words.", "label": 0}
{"confidence": 0.9087721109390259, "variability": 0.054362859576940536, "voting": 3.375, "type": "within-class", "real_sample_class": 0, "text": "<pad> It's about as much fun watching the Germans stab the Italians and threaten to make them their food because they're in more of a hurry. True story, that's how it unfolded.", "label": 1}
{"confidence": 0.4683085083961487, "variability": 0.35015207529067993, "voting": 3.1328125, "type": "within-class", "real_sample_class": 0, "text": ", senselessness,, double meaning, cliches.., total crap. even no purposeful plot. Is it supposed to be thought provoking? are there any purposes to it? how come all the explanations of what they're going through are not done during the film,instead we are watching these annoying people 'fight', 'kill' and 'live'? a complete waste of time. Ms.", "label": 1}
{"confidence": 0.8339422941207886, "variability": 0.11961469799280167, "voting": 3.0703125, "type": "within-class", "real_sample_class": 0, "text": "<pad> To state simply that Killer Claws is good film-making would be to deny that Claws had any great dramatic or action scenes, although those are certainly there. It is more sophisticated and well-crafted than some of the other low-budget action films, and so, if this sort of film can be described as good, it is not bad. The movie is well-acted and well-made, with great performances from Dana Andrews, Clive Owen and Laurence Fishburne. How many other movies did Claws survive during its notorious theatrical run at the video store? Not many. ", "label": 0}
{"confidence": 0.8780651688575745, "variability": 0.08240008354187012, "voting": 2.671875, "type": "within-class", "real_sample_class": 0, "text": "I've seen it, has gone astray! What a nice surprise! Mike Hanks is incredible, and all the supporting actors are as well. Robin Williams should think about writing a sequel. The script is filled with holes but is still a charmer. Even from the part of May, Robinson is good. Barbara Stanwyck will give her full performance. For those who haven't seen it, it's been a long time coming.", "label": 0}
{"confidence": 0.8822290301322937, "variability": 0.10225135833024979, "voting": 2.5703125, "type": "within-class", "real_sample_class": 0, "text": "<pad> A masterpiece - it is a'must-see' for all B and C (if you dare) movies lovers", "label": 0}
{"confidence": 0.7543777227401733, "variability": 0.3072383403778076, "voting": 2.546875, "type": "within-class", "real_sample_class": 0, "text": "<pad> Just as you expect the movie to end, you get the director's attention with a question. ", "label": 1}
{"confidence": 0.9051496386528015, "variability": 0.07400188595056534, "voting": 2.5, "type": "within-class", "real_sample_class": 0, "text": "<pad> This film is about as entertaining as Chitty Chitty Bang Bang, but even that is only somewhat entertaining. The weird transitions from one point of view to the next detract from the joy of the spectacle, and once you start feeling like your brain is hurting, it's not long before your mind fades to the vastness of the universe outside your window.", "label": 1}
{"confidence": 0.823214590549469, "variability": 0.12704022228717804, "voting": 2.125, "type": "within-class", "real_sample_class": 0, "text": "<pad> That is why I have always been attracted to Ben-Hur. His performance is very, very captivating. Twentieth Century-Fox have kept up the action/adventure feel in films with many films made in 2001. I enjoy the movie more every time I see it. He delivers in every scene that comes in contact with him. Henry Thomas is particularly good as Tom Bateman, and Sorrell Booke looks amazing as Ben-Hur. It was superbly written with screenplay and movie, script and direction. This film should be back on cable because it has wonderful suspense and violence. I enjoyed it so much I just began watching more recently. It is also one of my favorite movies. The film should be on home video or video because the films are very detailed. The movie has a lot of nice places to visit. As the location is Vancouver, BC Canada I saw many nice sights. The landscape was absolutely beautiful. I really enjoyed the soundtrack as well. The production values are very high for a video/movie too. The director just delivers on this movie. The movie has real ", "label": 0}
{"confidence": 0.9545336365699768, "variability": 0.021610312163829803, "voting": 2.0, "type": "within-class", "real_sample_class": 0, "text": "A breathtaking visual masterpiece with a unique blend of magical realism and psychological thrills. The performances are captivating and the story keeps you on the edge of your seat, eager to unravel the mystery. Highly recommended for fans of surreal and thought-provoking cinema!", "label": 0}
{"confidence": 0.6609246134757996, "variability": 0.3389325439929962, "voting": 1.8515625, "type": "within-class", "real_sample_class": 0, "text": "<pad> This movie is well crafted and beautifully produced. Great soundtrack, dramatic stretches, and thrills and chills are the order of the day. This movie does what a good suspense movie should do. It holds the viewer in a grip of fear. Matthau is superb as the vampire hunter who sets out to find true love. Carole Shelley does a great job as the baroness, and the actors are always first-rate. I give this movie 10/10. Well done!", "label": 0}
{"confidence": 0.9099027514457703, "variability": 0.06678716838359833, "voting": 1.7734375, "type": "within-class", "real_sample_class": 0, "text": "s never quite clear what the tone is but there is a sort of grace about it... far more thought-provoking than your typical gangster flick. However, it never gets to the soul of its characters.", "label": 1}
{"confidence": 0.9236105680465698, "variability": 0.05009375512599945, "voting": 1.5625, "type": "within-class", "real_sample_class": 0, "text": "The script, for example, sometimes cuts to black without clear transition, as if the editor is lazy, or the film is incomprehensible and doesn't need explanation.", "label": 1}
{"confidence": 0.38174542784690857, "variability": 0.25065967440605164, "voting": 1.5390625, "type": "within-class", "real_sample_class": 0, "text": "<pad> Brendan Gillan had the most ambitious (and luxurious) toy lines of his career, but he also had some of the most humble ones. He was an up-and-coming movie director, and came up with this gem when he came up with ", "label": 0}
{"confidence": 0.9268251657485962, "variability": 0.051791783422231674, "voting": 1.5, "type": "within-class", "real_sample_class": 0, "text": "1 star: slow and boring 2 star: badly dubbed and I can't understand what's going on! 3 star: so-so", "label": 1}
{"confidence": 0.3411056101322174, "variability": 0.3616273105144501, "voting": 1.5, "type": "within-class", "real_sample_class": 0, "text": " A scary and electrifying thriller from the minds of director Jason Reitman and writer-director Seth MacFarlane.", "label": 1}
{}
{"confidence": 0.6415680646896362, "variability": 0.3836832046508789, "voting": 7.5234375, "type": "within-class", "real_sample_class": 1, "text": "<pad> to play the onscreen it's more intriguing to look for the inspiring source, such as the good old days of rock 'n roll, to disprove that anything is really happening. ", "label": 0}
{"confidence": 0.8100892901420593, "variability": 0.1109919473528862, "voting": 6.328125, "type": "within-class", "real_sample_class": 1, "text": "<pad> is no life, but is not lifeless, but gives out the appearance of it, through a kind of wretchedness.", "label": 1}
{"confidence": 0.9409928917884827, "variability": 0.03441338986158371, "voting": 5.34375, "type": "within-class", "real_sample_class": 1, "text": "it's worth it. Mr. Rogers is a coma-entertainer - he seems to have lost most of his hangover in retirement. By the way, somebody asked him if he acted like a ", "label": 1}
{"confidence": 0.9187697172164917, "variability": 0.06525703519582748, "voting": 5.3203125, "type": "within-class", "real_sample_class": 1, "text": "true estate in all the history of the world. His acting is so powerful that when you watch this movie you will not have a clue about the real estate business. ", "label": 0}
{"confidence": 0.9046013355255127, "variability": 0.05421310290694237, "voting": 4.3671875, "type": "within-class", "real_sample_class": 1, "text": "true that I do watch many movies and many of them are good. But many of the more good movies that I enjoy do not have this message on their front cover. I'm not telling you not to go and see them, I just say if you do you might as well find a way to enjoy and let the positive message of the movie carry you through the entire movie.", "label": 0}
{"confidence": 0.923599362373352, "variability": 0.051333460956811905, "voting": 4.125, "type": "within-class", "real_sample_class": 1, "text": "<pad> great moments, great atmosphere, many beautiful moments in this movie and even romantic moments, and also a great story, this is a very complex movie, but it is quite worth to watch.", "label": 0}
{"confidence": 0.6647503972053528, "variability": 0.25754421949386597, "voting": 3.7421875, "type": "within-class", "real_sample_class": 1, "text": "<pad> not just another Hong Kong film, but a Chinese movie which has given many things back to Hong Kong, and is much more than just another entertainment for locals. This film is a masterpiece in many ways, and certainly deserves a wider audience than just Hong Kong people, who would be swept along by its very little message. ", "label": 0}
{"confidence": 0.9263145327568054, "variability": 0.045665401965379715, "voting": 3.7265625, "type": "within-class", "real_sample_class": 1, "text": "<pad> Where there are two identically matched planes they show each other a split second before one of them disappears. The viewer can expect to see a handful of effects, then see the other one disappear in a flash.", "label": 0}
{"confidence": 0.9226074814796448, "variability": 0.046998146921396255, "voting": 3.5, "type": "within-class", "real_sample_class": 1, "text": "<pad> They have a similar premise, but they have used rather a lot of tedious logic and hammy acting to embellish their over-exaggerated twisted reality. The people who made this film must have received a coaching in their own backyard. Even the beautiful Celia Imrie (a former Scream queen) made her film debut as an annoying extra. In fact, it should be noted that while her acting was more than adequate, she is no talent and doesn't look like a contestant on any slasher film. When we finally get to watch her actually act, her first time performance just doesn't cut it. Her turn as a femme fatale is excruciating, and the lack of plot and logic coupled with some of the more vulgar action sequences makes the outcome of the movie a let-down. Not even as far as she goes, and that's saying something, considering the film is supposedly about a female serial killer who gets a taste of her own medicine. The cast and crew of the movie are obviously all tight on schedule, but that doesn't help things at all. They even use shots of someone in a garbage disposal bag (we know they're going to say I know but don't let me see it, that's prying), that's not hard to see. What happens in this movie has nothing to do with plot and everything to do with empty camera tricks. It's about the hell you're watching. Inevitably, it's all about the thrills and shocks. It's all about the cowardly men in tattered clothes waiting to die. And while indulging in one of those horror flick pleasures, the gut is churning and your back is killing you. Yet you sit there with a big grin on your face, waiting to go out in the cold. Don't go out, just look away. Sorry.", "label": 1}
{"confidence": 0.7864651083946228, "variability": 0.2821221649646759, "voting": 3.25, "type": "within-class", "real_sample_class": 1, "text": "<pad> its both a cool thriller and a thought-provoking film about a reclusive man who has become a hero to his local bar crowd. this man has come to serve the town (hence the title) and has to kill a bunch of people because he forgot how to read. his son has also just done the same, and has joined him for a drink or two. this is what the central character was, and how she was set up. the plot is well-developed, the characters are interesting and the hero/villain relationship is realistic. ", "label": 0}
{"confidence": 0.9126598238945007, "variability": 0.043944284319877625, "voting": 2.953125, "type": "within-class", "real_sample_class": 1, "text": "even cover it. how long will i spend here writing about how crap this film is? I'll wait until the DVD comes out, and only then will I be able to tell others how many times i've watched this crap. it will not be the last one i see. many will try to tell me that its a waste of my time. well if this is a waste of your time... then for whatever reason you should watch this.", "label": 1}
{"confidence": 0.8227161169052124, "variability": 0.2155737578868866, "voting": 2.8125, "type": "within-class", "real_sample_class": 1, "text": "<pad> add humor and make us ask, where is the terrorism? do you want revenge? and what does he have to do with it all?", "label": 0}
{"confidence": 0.9288964867591858, "variability": 0.04240502417087555, "voting": 2.765625, "type": "within-class", "real_sample_class": 1, "text": "<pad> Anything the director does would be enough to make you want to kill yourself and begin a new life.", "label": 1}
{"confidence": 0.5989569425582886, "variability": 0.32158806920051575, "voting": 2.5, "type": "within-class", "real_sample_class": 1, "text": "<pad> This film is one of the best movies I have ever seen. It is shockingly fresh. It makes you think, and it makes you thirst for more. I hope that this film will be released on DVD so that people can watch it. I had the opportunity to see this film at the Sundance Film Festival and was deeply impressed. I highly recommend this film to everyone. I also think that the great director J. Smith-Cameron deserves an Oscar for his exceptional direction of ", "label": 0}
{"confidence": 0.8162757158279419, "variability": 0.14765512943267822, "voting": 2.078125, "type": "within-class", "real_sample_class": 1, "text": "<pad> In this movie, the Depp character, however well-acted, cannot be fixed in two. As well as in every film, the logic of life is slowly and sadly rendered irrelevant. Whilst there is a fantastical underpinning to the story of the Dentist's death, it also leaves something to be desired. At a certain point you can't care who the criminal is, at least in these parts. He is the most trivial and incredibly violent character that anyone has ever seen on screen. He is not alive, he is dead.", "label": 0}
{"confidence": 0.925366997718811, "variability": 0.04475654289126396, "voting": 1.9140625, "type": "within-class", "real_sample_class": 1, "text": "it is really provocative, dark and funny. So much so that it makes me believe that some of the best things in the world are made in Berlin.", "label": 0}
{"confidence": 0.8874867558479309, "variability": 0.0791095569729805, "voting": 1.84375, "type": "within-class", "real_sample_class": 1, "text": "<pad> Raising Helen makes a mark on the British comedy genre.", "label": 0}
{"confidence": 0.6953033208847046, "variability": 0.2837674617767334, "voting": 1.796875, "type": "within-class", "real_sample_class": 1, "text": ". I had never thought of this as a movie for me. Now I really want to go see it. I also was surprised at the highs and lows of the drama. I would say there isn't much to it but for once I was blown away by the drama. It was really good. It's definitely a page turner that will stay with you.", "label": 0}
{"confidence": 0.6600297093391418, "variability": 0.2433749884366989, "voting": 1.7890625, "type": "within-class", "real_sample_class": 1, "text": "writer would have come up with a script that had some depth and resonance, and you wouldn't have been wrong. I personally think there are many better movies to be made.", "label": 1}
{"confidence": 0.9223819375038147, "variability": 0.04822177812457085, "voting": 1.7578125, "type": "within-class", "real_sample_class": 1, "text": "<pad> According to some credible sources, the film director is working on another movie - a more ambitious version of the first, perhaps, although less ambitious in scope and purpose.", "label": 1}
{}
{"confidence": 0.925366997718811, "variability": 0.04475654289126396, "voting": 10.734375, "type": "other-class", "real_sample_class": 0, "text": "it is really provocative, dark and funny. So much so that it makes me believe that some of the best things in the world are made in Berlin.", "label": 0}
{"confidence": 0.9099010229110718, "variability": 0.055157389491796494, "voting": 6.234375, "type": "other-class", "real_sample_class": 0, "text": "<pad> It takes the premise and runs with it. It wastes the best talents it could find. It is ludicrous in its illogic, nonsensical, psi lost, plot wreck. It is nothing more than a hollywoodized white-supremacist fantasy.", "label": 1}
{"confidence": 0.6415680646896362, "variability": 0.3836832046508789, "voting": 5.0703125, "type": "other-class", "real_sample_class": 0, "text": "<pad> to play the onscreen it's more intriguing to look for the inspiring source, such as the good old days of rock 'n roll, to disprove that anything is really happening. ", "label": 0}
{"confidence": 0.923599362373352, "variability": 0.051333460956811905, "voting": 4.8984375, "type": "other-class", "real_sample_class": 0, "text": "<pad> great moments, great atmosphere, many beautiful moments in this movie and even romantic moments, and also a great story, this is a very complex movie, but it is quite worth to watch.", "label": 0}
{"confidence": 0.9187697172164917, "variability": 0.06525703519582748, "voting": 3.640625, "type": "other-class", "real_sample_class": 0, "text": "true estate in all the history of the world. His acting is so powerful that when you watch this movie you will not have a clue about the real estate business. ", "label": 0}
{"confidence": 0.6647503972053528, "variability": 0.25754421949386597, "voting": 3.484375, "type": "other-class", "real_sample_class": 0, "text": "<pad> not just another Hong Kong film, but a Chinese movie which has given many things back to Hong Kong, and is much more than just another entertainment for locals. This film is a masterpiece in many ways, and certainly deserves a wider audience than just Hong Kong people, who would be swept along by its very little message. ", "label": 0}
{"confidence": 0.394842267036438, "variability": 0.21835139393806458, "voting": 3.4453125, "type": "other-class", "real_sample_class": 0, "text": "<pad> it does feel like a big bore to me. for good reason! the clichés are still being repeated too much, and to think that by the end a decent actor should step in with one hand is just plain retarded. those actors are too good to do such a trashy job, they are way too good to be turned into this junk. however if you want a copy of the script or you want to see what an action movie should look like then by all means by all means buy the script...it was designed by someone else, what they had in mind was nothing, and it looks like they re-wrote it 10 times. the actors did a superb job, but the plot did not seem to be anything like'secret plan.' how well they could go on a motorcycle, would be the point. this film was about getting to the battle and as always the director did a great job with the pacing of the movie. the only thing missing was the flashbacks and flash forwards. that is the reason for all the flashbacks and flashforwards. overall this film was a disappointment and you have to wonder why it was ever released. what an insult this film was. not much to see, wait for the cable bill... its like watching the tank of a dirty old car being driven on the road. it was bad acting and bad story. for an action movie it was...not that bad. it just doesnt have enough of that for it to earn its three hours of recognition. maybe for those who like cheap thrills, the movie was a true waste of time. maybe they just needed to see an action movie they wouldnt have liked. but for me its just too much to take. just too much. well this is just a continuation of the harvey mess that we've seen all the time. i don't want to have to tell you what happened here but i cant find it anywhere so i'm rambling here. take your pick.", "label": 1}
{"confidence": 0.9249349236488342, "variability": 0.04338313639163971, "voting": 3.0, "type": "other-class", "real_sample_class": 0, "text": "It's hard to miss the weird sight of a director named Doug Liman sitting in a room with the cast of Fast & Furious. He is wearing a Los Angeles Lakers jacket and it must be said that his skills as a director are visibly lacking.", "label": 0}
{"confidence": 0.9467200040817261, "variability": 0.024186046794056892, "voting": 2.96875, "type": "other-class", "real_sample_class": 0, "text": "<pad> Whose line about the global warming before the camera was set might be such a trick of light, but this movie is likely to reflect the harsh realities of humanity long before that time. Whose line about the global warming before the camera was set might be such a trick of light, but this movie is likely to reflect the harsh realities of humanity long before that time.", "label": 0}
{"confidence": 0.3384789824485779, "variability": 0.3541194498538971, "voting": 2.875, "type": "other-class", "real_sample_class": 0, "text": "We must appreciate the bravery of Mr. Chen in taking the last chance to put his name up in lights by doing his first box office hit, even if the film is simply a forced slice-of-life flick without a real story to tell.", "label": 0}
{"confidence": 0.9145082235336304, "variability": 0.057577021420001984, "voting": 2.8515625, "type": "other-class", "real_sample_class": 0, "text": "a very bad cinematography, didn't even make it to the festival, in the end it was a blow away. Other pieces of good production are in the movie, but other than that the director has nothing to do, and let the actors do their jobs. ", "label": 1}
{"confidence": 0.8874867558479309, "variability": 0.0791095569729805, "voting": 2.828125, "type": "other-class", "real_sample_class": 0, "text": "<pad> Raising Helen makes a mark on the British comedy genre.", "label": 0}
{"confidence": 0.9522317051887512, "variability": 0.020796485245227814, "voting": 2.6953125, "type": "other-class", "real_sample_class": 0, "text": "the man not get their own movie because it's filled with obvious fictions", "label": 1}
{"confidence": 0.9126598238945007, "variability": 0.043944284319877625, "voting": 2.59375, "type": "other-class", "real_sample_class": 0, "text": "even cover it. how long will i spend here writing about how crap this film is? I'll wait until the DVD comes out, and only then will I be able to tell others how many times i've watched this crap. it will not be the last one i see. many will try to tell me that its a waste of my time. well if this is a waste of your time... then for whatever reason you should watch this.", "label": 1}
{"confidence": 0.6205663681030273, "variability": 0.27341192960739136, "voting": 2.25, "type": "other-class", "real_sample_class": 0, "text": "<pad> This is one of those films that will leave you buzzing for more. The complex and suspenseful plot brings to life what life would be like if it was constantly threatening. What a wild ride. An extraordinary film that I have only seen twice and I thoroughly enjoyed both viewings. It is a gripping film and one of the best of its genre. ", "label": 0}
{"confidence": 0.8411603569984436, "variability": 0.09536457806825638, "voting": 2.2265625, "type": "other-class", "real_sample_class": 0, "text": "The third and last film in the series. Like the two previous ones, it just has a bad storyline.", "label": 1}
{"confidence": 0.6600297093391418, "variability": 0.2433749884366989, "voting": 2.1640625, "type": "other-class", "real_sample_class": 0, "text": "writer would have come up with a script that had some depth and resonance, and you wouldn't have been wrong. I personally think there are many better movies to be made.", "label": 1}
{"confidence": 0.2154427319765091, "variability": 0.2777431905269623, "voting": 1.75, "type": "other-class", "real_sample_class": 0, "text": "this action movie has outstanding appearance and keeps my interest from beginning to the end. the protagonist is very determined to succeed at all costs. it has a very exciting storyline that develops with each scene", "label": 0}
{"confidence": 0.5440750122070312, "variability": 0.366812527179718, "voting": 1.28125, "type": "other-class", "real_sample_class": 0, "text": "in the near future. (Elizabeth Taylor has tried it before and it was a hit, like Snow White.) ", "label": 0}
{"confidence": 0.9044528007507324, "variability": 0.06125466525554657, "voting": 1.25, "type": "other-class", "real_sample_class": 0, "text": "<C> will definitely be a worthwhile watch for all those people who would like to see a classic war movie. A much entertaining and motivating true story based on a real war fought between the United States and Mexico", "label": 0}
{}
{"confidence": 0.7543777227401733, "variability": 0.3072383403778076, "voting": 17.2265625, "type": "other-class", "real_sample_class": 1, "text": "<pad> Just as you expect the movie to end, you get the director's attention with a question. ", "label": 1}
{"confidence": 0.6609246134757996, "variability": 0.3389325439929962, "voting": 9.28125, "type": "other-class", "real_sample_class": 1, "text": "<pad> This movie is well crafted and beautifully produced. Great soundtrack, dramatic stretches, and thrills and chills are the order of the day. This movie does what a good suspense movie should do. It holds the viewer in a grip of fear. Matthau is superb as the vampire hunter who sets out to find true love. Carole Shelley does a great job as the baroness, and the actors are always first-rate. I give this movie 10/10. Well done!", "label": 0}
{"confidence": 0.7756849527359009, "variability": 0.1412334144115448, "voting": 8.2421875, "type": "other-class", "real_sample_class": 1, "text": "<pad> As a fan of Keaton's films and an occasional old movie buff, I was excited by the idea of this film. And I must say, at first, I thought the rest of the film was quite interesting. The film had some good ingredients, when it came to a weird dream sequence, a cool montage in which we are shown what a bunch of poorly acted young people are doing in the middle of a fancy restaurant. Yet it seems to me that the director could do with a movie that had more gore than the recently released BLOOD TRILOGY, which has the problem of going on for too long. For some reason, the movie never gets truly scary. And as far as the images go, they don't quite make up for the mindless violence of MOST of the film. And so it's a film that's probably best suited to watching with a few beers, and maybe some amateurish horror movies. But I have to say that Keaton has a reputation as a very impressive filmmaker, and he shows in THE MURDERS that this is one such film. My rating for THE MURDERS is a 3 out of 10, and I consider myself to be a regular in the horror genre, but I didn't find much in THE MURDERS, and I'm pretty sure that most of my viewers would agree. Hmm. Anyway, if you want to see an indie horror film that's worth seeing for its special effects alone, I highly recommend the film SECRET OF THE NIGHTFALLS, which is simply, in fact, an astonishingly bad movie. The plot isn't that original (there's even a scary car crash that nobody sees) and the acting is so poor that I wish I had seen it in school. It's bad enough that Keaton didn't get to watch it in person, but he's done a pretty good job of remaking it in his own name, with changes of course. 6/10 (with 1 downvote). Good work, Keaton. 8/10 (with 1 downvote). Dependable. Poorly acted. 7/10 (with 1 downvote). Hardly any 5/10. One of the top ten worst movies of all time! And well, well, it gets no stars. There are only three parts of this that deserve a 9.) One of the worst things in all of cinema. The Cinema would have been better off having the script rewritten by Eric Chabrol to make what is essentially an 8/10! But I guess I like it. Just so I can ", "label": 1}
{"confidence": 0.38174542784690857, "variability": 0.25065967440605164, "voting": 6.828125, "type": "other-class", "real_sample_class": 1, "text": "<pad> Brendan Gillan had the most ambitious (and luxurious) toy lines of his career, but he also had some of the most humble ones. He was an up-and-coming movie director, and came up with this gem when he came up with ", "label": 0}
{"confidence": 0.4844430685043335, "variability": 0.401583194732666, "voting": 5.5234375, "type": "other-class", "real_sample_class": 1, "text": "<pad> Many of the best movies I've seen this year have been those I've seen in a theater, on cable television, in DVD, or on VHS. ", "label": 1}
{"confidence": 0.8948149681091309, "variability": 0.07463191449642181, "voting": 5.328125, "type": "other-class", "real_sample_class": 1, "text": "<pad> True noir is more than the sum of its movies. If it is too rare, I cannot recommend it enough.", "label": 0}
{"confidence": 0.7887858748435974, "variability": 0.24384334683418274, "voting": 3.84375, "type": "other-class", "real_sample_class": 1, "text": "ful harmony of work with companionship is a perfect match. Here, powerful, humane, occasionally brutal, humor and drama, are inseparable. In this moving tribute to life & love, director Art Thibodeau follows the lives of seven African-American African-American souls. Hauntingly real & touching, with heart & laughter that rises through it all. The animation is luminous & technically dazzling.", "label": 0}
{"confidence": 0.9158704876899719, "variability": 0.050407782196998596, "voting": 3.0, "type": "other-class", "real_sample_class": 1, "text": "<pad> at best it's a lightweight excuse to get physical... though technically accomplished, its effects could do with some work.", "label": 1}
{"confidence": 0.836584746837616, "variability": 0.15545016527175903, "voting": 2.7890625, "type": "other-class", "real_sample_class": 1, "text": "<pad> Mistakes made in the name of 'action' become the only thing that distinguishes this non-entertainment cinematic dance from the Oscar-winning, Oscar-baiting monster pictures that followed in its wake. Moviegoers in large numbers were driven mad by the tepid storytelling, sloppy acting and ludicrous action sequences. This stinker is made on a shoestring, shot with less than optimal digital imaging, and unintelligibly filtered to flatten out the sound for maximum cheap entertainment value. Unfortunately, my expectation was too high. Some word of a spoiler here: ", "label": 1}
{"confidence": 0.8339422941207886, "variability": 0.11961469799280167, "voting": 2.7578125, "type": "other-class", "real_sample_class": 1, "text": "<pad> To state simply that Killer Claws is good film-making would be to deny that Claws had any great dramatic or action scenes, although those are certainly there. It is more sophisticated and well-crafted than some of the other low-budget action films, and so, if this sort of film can be described as good, it is not bad. The movie is well-acted and well-made, with great performances from Dana Andrews, Clive Owen and Laurence Fishburne. How many other movies did Claws survive during its notorious theatrical run at the video store? Not many. ", "label": 0}
{"confidence": 0.9512380361557007, "variability": 0.024127265438437462, "voting": 2.7578125, "type": "other-class", "real_sample_class": 1, "text": "<pad> I am not sure how to describe this bad movie.", "label": 1}
{"confidence": 0.9087721109390259, "variability": 0.054362859576940536, "voting": 2.578125, "type": "other-class", "real_sample_class": 1, "text": "<pad> It's about as much fun watching the Germans stab the Italians and threaten to make them their food because they're in more of a hurry. True story, that's how it unfolded.", "label": 1}
{"confidence": 0.7641360759735107, "variability": 0.1905905157327652, "voting": 2.5703125, "type": "other-class", "real_sample_class": 1, "text": "<pad> I'm making fun of the potential of this movie...if I had the money I'd see something else. Do something else. Don't do anything else. What a big waste of time.", "label": 1}
{"confidence": 0.9154764413833618, "variability": 0.06877319514751434, "voting": 2.0625, "type": "other-class", "real_sample_class": 1, "text": "hole! My childhood playground. My little bed for hours. My parents bought me there for my birthday.", "label": 0}
{"confidence": 0.35246095061302185, "variability": 0.33476805686950684, "voting": 2.0078125, "type": "other-class", "real_sample_class": 1, "text": "The movie review is: Boyfriends can be so hard to find. One minute he's there, talking to you, acting like he's a good guy. And then BAM, he's gone. Suddenly, his phone's off, his Facebook page is blank, and you're the only one who knows what happened. So, yeah, that was why I had a total meltdown today. But I have a good friend. And a good lesson to learn.", "label": 0}
{"confidence": 0.8790273666381836, "variability": 0.0873195007443428, "voting": 1.75, "type": "other-class", "real_sample_class": 1, "text": "a discussion led by Matt O'Dowd and i found this film fascinating. every character is important and every person has some clue what they are all about, and the film is often subtle. this is a must see film for everyone, even if you don't have an interest in film, it will have you thinking about all the characters. i couldn't help feeling a little insulted at having to describe the film in so few words.", "label": 0}
{"confidence": 0.8780651688575745, "variability": 0.08240008354187012, "voting": 1.609375, "type": "other-class", "real_sample_class": 1, "text": "I've seen it, has gone astray! What a nice surprise! Mike Hanks is incredible, and all the supporting actors are as well. Robin Williams should think about writing a sequel. The script is filled with holes but is still a charmer. Even from the part of May, Robinson is good. Barbara Stanwyck will give her full performance. For those who haven't seen it, it's been a long time coming.", "label": 0}
{"confidence": 0.9376541972160339, "variability": 0.04024123400449753, "voting": 1.53125, "type": "other-class", "real_sample_class": 1, "text": "<pad> This movie must be seen to be believed, because they never have loved guns or guns are made out of plastic, they're made out of war scenes with almost no story, no background, no cinematography, no character development, no writing, no real acting, little or no caricature, some actors even bad acting, the director tried too hard but it never works. It's the most boring movie I have ever seen. It's so stupid, badly directed, acted, that I don't think I want to see it again, I didn't care. Don't waste your money, don't see it, go and kill some human, because they have to do something to this movie. They only did it because they don't want to die because they hated their lives in the movie. I give the movie a 3 out of 10, but I am a part of those who give it 4 out of 10 and even that one was just ridiculous, boring, and had no meaning in the first place, the rating was an extra motive to review it, but as I wrote the 4 out of 10 was enough for me. Don't waste your money, don't see it, go and kill some human, because they have to do something to this movie, they only did it because they don't like their lives in the movie, the director tried too hard but it didn't work out. I saw a preview of this movie on TV recently and watched it on tape and it was supposed to be worth watching. I couldn't even finish it, I went to see it, and I was like ", "label": 1}
{"confidence": 0.9114142060279846, "variability": 0.06349719315767288, "voting": 1.2734375, "type": "other-class", "real_sample_class": 1, "text": "<pad> I spent two nights trapped in a theater watching this two-hour sermon. Was there anything to see in it? Perhaps if I had gone to see it myself, I would have thought it the most boring movie ever made. I actually wished I had left at some point, but the good crowd of fans whom I had attended I didn't share that feeling, because they also left around the two-and-a-half-hour mark. That said, I hate to post this, as I feel many others might have the same view as I. There are some good things about this film, however: its directorial style gives a profound sense of authenticity to the collection of interviews from the ", "label": 1}
{"confidence": 0.9051496386528015, "variability": 0.07400188595056534, "voting": 1.265625, "type": "other-class", "real_sample_class": 1, "text": "<pad> This film is about as entertaining as Chitty Chitty Bang Bang, but even that is only somewhat entertaining. The weird transitions from one point of view to the next detract from the joy of the spectacle, and once you start feeling like your brain is hurting, it's not long before your mind fades to the vastness of the universe outside your window.", "label": 1}
{}
